video_id_ru = "BAACAgIAAxkDAAIHSV73c5mEy1v7VjBjcTbGNEJ0acj9AALbBgACLDa5S4_J_5EhXLQ7GgQ"
video_id_kz = "BAACAgIAAxkDAAIHS173dAF0tO8QY-RroFaq7mEXtwMxAALdBgACLDa5SxeYAAE4TsNxJxoE"

localization = {
    'ru': {
        'yes': 'Да',
        'no': 'Нет',
        'offer': "Вам нравится наше предложение? Вы готовы сотрудничать с нами?",
        'name': "Напишите пожалуйста ваше имя",
        'name_single': 'Имя',
        'city_single': 'Город',
        'number_single': 'Номер',
        'city': "выберите город в котором вы проживаете",
        'phone': 'Напишите пожалуйста номер телефона, по которому мы можем связаться с Вами',
        'deny': 'Вы отказались от участия в потребительском кооперативе',
        'confirm': 'Подтвердите данные пожалуйста',
        'send_contact': 'Отправить контакт',
        'number': 'Прекрасный город. Теперь отправьте номер телефона. Нажмите на кнопку, чтобы поделиться номером. Если вы хотите указать другой номер, то введите его в формате +77021745639.',
        'number_exists': 'Номер уже зарегестрирован. Введите другой номер в формате +77021745639',
        'number_invalid': 'Что-то не похоже на нормальный номер. Если не хотите вводить номер, то проще нажать на кнопку "Отправить контакт". Или же введите его в формате +77021745639.',
        'cancel_registration':  'Регистрация отменена',
        'already_registered': 'Пользователь уже зарегестрирован',
        'success_registration': 'Отлично, данные сохранены'
    },
    'kz': {
        'yes': 'Йә',
        'no': 'Жоқ',
        'offer': "Cізге біздің ұсыныс жақты ма? Бізбен іске кірісуге дайынсыз ба?",
        'name': "Атыңыз кім?",
        'name_single': 'Аты',
        'city_single': 'Қала',
        'number_single': 'Нөмір',
        'city': "қазір тұрып жатқан қаланы таңдаңыз",
        'phone': 'Телефон нөміріңізді теріңіз',
        'deny': 'Сіз бас тарттыңыз',
        'confirm': 'Тіркеуді растаңыз',
        'send_contact': 'Нөмірді жіберу',
        'number': 'Керемет қала. Енді телефон нөміріңізді жіберіңіз. Нөмірді жіберу үшін астындағы түймені басыңыз. Егер басқа нөмірді тіркегіңіз келсе, онда оны +77021745639 форматында теріңіз.',
        'number_exists': 'Нөмір әлдеқашан тіркелген. +77021745639 форматында басқа нөмір теріңіз',
        'number_invalid': 'Нөмір бұрыс. Астындағы түймені басыңыз. Немесе +77021745639 форматында нөмірді теріңіз.',
        'cancel_registration':  'Тіркеу тоқтатылды',
        'already_registered': 'Қолданушы әлдеқашан тіркелген',
        'success_registration': 'Тамаша, деректер сақталды'
    }
}
