token = "1217988314:AAFzC6WYtQZUw1ZMdlfU0zE_3OKX0V3weI0"
video_id = "BAACAgIAAxkDAAMWXt_AyjRDILjidvjH_nQ3hhsiQnAAAlYGAAJIoAABS3-T7oCbOvwGGgQ"
database_name = 'shaqyru.db'
invite_link = 'https://t.me/joinchat/QgJJsVYyxAtZCCyI2vvcNQ'

localization = {
    'ru': {
        'yes': 'Да',
        'no': 'Нет',
        'offer': "Вам нравится наше предложение? Вы готовы сотрудничать с нами?",
        'name': "Напишите пожалуйста ваше имя",
        'city': "выберите город в котором вы проживаете",
        'phone': 'Напишите пожалуйста номер телефона, по которому мы можем связаться с Вами',
        'deny': 'Вы отказались от участия в потребительском кооперативе',
        'confirm': 'Вы уверены что хотите зарегистрироваться?',
        'send_contact': 'Отправить контакт',
        'number': 'Прекрасный город. Теперь отправьте номер телефона. Нажмите на кнопку, чтобы поделиться номером. Если вы хотите указать другой номер, то введите его в формате +77021745639.',
        'number_exists': 'Номер уже зарегестрирован. Введите другой номер в формате +77021745639',
        'number_invalid': 'Что-то не похоже на нормальный номер. Если не хотите вводить номер, то проще нажать на кнопку "Отправить контакт". Или же введите его в формате +77021745639.',
        'cancel_registration':  'Регистрация отменена',
        'invite': f'Данные сохранены \. Я приглашаю тебя в [чат]({invite_link})'
    },
    'kz': {
        'yes': 'Йә',
        'no': 'Жоқ',
        'offer': "Cізге біздің ұсыныс жақты ма? Бізбен іске кірісуге дайынсыз ба?",
        'name': "Атыңыз кім?",
        'city': "қазір тұрып жатқан қаланы таңдаңыз",
        'phone': 'Телефон нөміріңізді теріңіз',
        'deny': 'Сіз бас тарттыңыз',
        'confirm': 'Тіркеуді растаңыз',
        'send_contact': 'Нөмірді жіберу',
        'number': 'Керемет қала. Енді телефон нөміріңізді жіберіңіз. Нөмірді жіберу үшін астындағы түймені басыңыз. Егер басқа нөмірді тіркегіңіз келсе, онда оны +77021745639 форматында теріңіз.',
        'number_exists': 'Нөмір әлдеқашан тіркелген. +77021745639 форматында басқа нөмір теріңіз',
        'number_invalid': 'Нөмір бұрыс. Астындағы түймені басыңыз. Немесе +77021745639 форматында нөмірді теріңіз.',
        'cancel_registration':  'Тіркеу тоқтатылды',
        'invite': f'Деректер сақталды \. Сізді [чатына]({invite_link}) кіруіңізді сұраймын'
    }
}
