languages = {'cb_ru': f"Русский 🇷🇺️", 'cb_kz': "Қазақша 🇰🇿️"}

l10n = {
    'ru': {
        'yes': 'Да',
        'no': 'Нет',
        'language': 'Выбран русский язык',
        'video': 'Просмотрите наше видео с партнерским предложением',
        'offer': "Хотите узнать больше?",
        'name': "Напишите пожалуйста ваше имя",
        'name_single': 'Имя',
        'city_single': 'Город',
        'number_single': 'Номер',
        'city': "выберите город в котором вы проживаете",
        'phone': 'Напишите пожалуйста номер телефона, по которому мы можем связаться с Вами',
        'deny': 'Вы отказались от участия в потребительском кооперативе. Если вы передумали напишите /start',
        'send_contact': 'Отправить контакт',
        'number': 'Прекрасный город. Осталось узнать ваш номер. Чтобы поделиться номером нажмите на кнопку внизу "Отправить контакт". Если вы хотите указать другой номер, то введите его в формате +77021745639.',
        'number_exists': 'Номер уже зарегестрирован. Введите другой номер в формате +77021745639',
        'number_invalid': 'Что-то не похоже на нормальный номер. Если не хотите вводить номер, то проще нажать на кнопку "Отправить контакт". Или же введите его в формате +77021745639.',
        'already_registered': 'Пользователь уже зарегестрирован',
        'success_registration': 'Отлично, данные сохранены. Скоро мы с вами свяжемся'
    },
    'kz': {
        'yes': 'Йә',
        'no': 'Жоқ',
        'language': 'Қазақ тілі таңдалды',
        'video': 'Біздің серіктестік ұсыныспен видеоны қарап көріңіз',
        'offer': "Көбірек білгіңіз келе ме?",
        'name': "Атыңыз кім?",
        'name_single': 'Аты',
        'city_single': 'Қала',
        'number_single': 'Нөмір',
        'city': "Қазір тұрып жатқан қаланы таңдаңыз",
        'phone': 'Телефон нөміріңізді теріңіз',
        'deny': 'Сіз бас тарттыңыз. Егер ойыңыз өзгерсе /start жазыңыз',
        'send_contact': 'Контактпен бөлісу',
        'number': 'Керемет қала. Енді нөміріңіз қалды. Нөмірді жіберу үшін астындағы "Контактпен бөлісу" түймені басыңыз. Егер басқа нөмірді тіркегіңіз келсе, онда оны +77021745639 форматында теріңіз.',
        'number_exists': 'Нөмір әлдеқашан тіркелген. +77021745639 форматында басқа нөмір теріңіз',
        'number_invalid': 'Нөмір бұрыс. Астындағы түймені басыңыз. Немесе +77021745639 форматында нөмірді теріңіз.',
        'already_registered': 'Қолданушы әлдеқашан тіркелген',
        'success_registration': 'Тамаша, деректер сақталды. Жақын арада біз сізге хабарласамыз'
    }
}
